Repository: 84000/data-translation-memory
Catalog: toh138_84000-the-ratnaketu-dharani.tmx
Source language: bo
Languages: en

source: ཆོས་མཉམ་པ་ཉིད་རྡོ་རྗེ་ལྟ་བུ་བརྟེན་པའི་ཆོས་ཀྱི་སྙིང་པོས་ལུས་འཇོམས་པ་ཞེས་བྱ་བའི་གཟུངས་ཕྱག་རྒྱ་དང་། ཚིག་རབ་ཏུ་དབྱེ་བ་ལ་འཇུག་པ་ལུང་བསྟན་པ་འདི་འཆད་པར་འགྱུར་གྱིས། ཁྱེད་ཅག་ལས་གང་ཆོས་མཉམ་པ་ཉིད་རྡོ་རྗེ་ལྟ་བུ་བརྟེན་པའི་ཆོས་ཀྱི་སྙིང་པོས་ལུས་འཇོམས་པ་ཞེས་བྱ་བའི་གཟུངས་ཕྱག་རྒྱ་དང་ཚིག་རབ་ཏུ་དབྱེ་བ་ལ་འཇུག་པ་ལུང་བསྟན་པ་མཉན་པ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཚད་མེད་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུས་གཅིག་ཏུ་སངས་རྒྱས་ཀྱི་ཞིང་གཅིག་ན་བཞུགས་པ་དེ་དག་ལ་མཆོད་པ་བྱ་བ་དང་། ཆོས་དེ་ཡང་ཉན་པ་དང་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་། ལྷའི་ཡུལ་དང་། བདུད་ཀྱི་ཡུལ་ཐམས་ཅད་དང་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྒྱན་བཀོད་པ་དེ་དག་ལ་བལྟ་བ་དང་། སངས་རྒྱས་མང་པོ་འདུས་པ་སྔོན་མ་མཐོང་མ་ཐོས་པ་བལྟ་བར་འདོད་པ་དེ་དག་དང་། ད་ངེད་ལྷན་ཅིག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ག་ལ་བ་དེར་འདོང་ངོ་། །དེ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་ཞིང་དེར་གཟུངས་འདི་འཆད་པ་ན།
en: So, if any of you wants to hear this exposition and to worship the blessed buddhas, as innumerable as the grains of sand in the river Gaṅgā, who are abiding together at the same time in the same buddha field, and if any of you want to hear their teachings and to see the domains of all the buddhas, bodhisattvas, gods, māras, and the marvelous ornamentation of all the buddha fields, and if any of you want to see a gathering of buddhas such as has never been seen or heard of, let us now go together to the Sahā world where the thus-gone, worthy, perfect buddha Śākyamuni dwells.”

source: གལ་ཏེ་བདག་ཅག་གིས་གནས་རྙེད་ཅིང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཇི་ལྟར་ཚོགས་པ་དེ་དག་ལ་ཡང་ཕྱག་བགྱི་བ་དང་། བསྙེན་བཀུར་བགྱི་བ་དང་། མཆོད་པ་དང་། ཆོས་ཉན་པར་རྔོ་ཐོགས་པ་ལྟ་ན་དེ་བཞིན་དུ་བདག་ཅག་ཀྱང་དེ་བཞིན་གཤེགས་པ་དང་ཐབས་ཅིག་ཏུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ག་ལ་བ་དེར་ཆོས་མཉམ་པ་ཉིད་རྡོ་རྗེ་ལྟ་བུ་བརྟེན་པའི་ཆོས་ཀྱི་སྙིང་པོས་ལུས་འཇོམས་པ་ཞེས་བྱ་བའི་གཟུངས་ཕྱག་རྒྱ་དང་ཚིག་རབ་ཏུ་དབྱེ་བ་ལ་འཇུག་པ་ལུང་བསྟན་པ་མཉན་པའི་སླད་དུ་མཆིས་ཏེ།
en: The bodhisattva great beings replied to their respective buddhas, “If this is so, O venerable Blessed One, we shall go together with you, our thus-gone one, to the Sahā world where the thus-gone, worthy, perfect buddha Śākyamuni dwells, in order to hear this exposition that we have not heard before.

source: དེར་བདག་ཅག་གིས་དུས་གཅིག་ཏུ་སངས་རྒྱས་ཀྱི་ཞིང་གཅིག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཚད་མེད་གྲངས་མེད་པ་ཞིག་བཞུགས་ཤིང་འཚོ་ལ་གཞེས་པ་རྣམས་ལ་མཆོད་པར་བགྱིའོ།
en: We shall worship there, all at the same time and on the same occasion, in the same buddha field, infinite numbers of blessed buddhas living and spending their time there.

source: །དེ་དག་ལས་ཆོས་ཀྱང་མཉན་པར་བགྱིའོ།
en: We will request them to teach us the Dharma.

source: །དེར་བདག་ཅག་གིས་རྫུ་འཕྲུལ་གྱི་ཡུལ་བཀོད་པ་བཞིས་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ལེགས་པར་བརྒྱན་པ་དེ་ཡང་བལྟ་བར་བགྱི།
en: We will see the Sahā world adorned with the miraculous displays originating from the four bases of supernatural power, and that great gathering in a marvelous array.

source: འདུས་པ་ཆེན་པོ་བཀོད་པ་དེ་དག་ཀྱང་བལྟ་བར་བགྱིའོ།
en: And if we manage to get a place in that buddha field while the dhāraṇī included in this exposition is being recited, we will be able to honor, praise, serve, and worship the buddhas and the bodhisattva great beings who have gathered there.”

source: །དེ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་སོ་སོ་ན་རང་རང་གི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་དང་། ཉན་ཐོས་ཆེན་པོ་དེ་དག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: Then each of the blessed buddhas in his respective buddha field spoke to his own retinue of bodhisattva great beings and congregation of great hearers:

source: །རིགས་ཀྱི་བུ་དག་ཁྱེད་ཅག་འཇིག་རྟེན་གྱི་ཁམས་དེར་འཇུག་པའི་གནས་དང་། གོ་སྐབས་ཀྱི་ཕྱིར་དེ་ལྟར་ཐེ་ཚོམ་མ་ཟ་ཞིག །དེ་ལྟར་ནེམ་ནུར་མ་བྱེད་ཅིག །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Do not be anxious, noble children, or have any doubts about whether there will be enough space available in that world to accommodate everybody. Why so?

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འཇུག་པ་མཉམ་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ལ་མཁས་པས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མཛད་པ་ནི་མཐའ་ཡས་སོ།
en: Because the blessed buddhas have an infinite ability to bring beings to maturity—an ability that derives from their skill in the wisdom of equality particular to their buddha fields.

source: །རིགས་ཀྱི་བུ་དག་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ཐབས་མཁས་པ་ཆེན་པོ་དང་ལྡན་པས་གོ་སྐབས་ཡངས་སོ། །རིགས་ཀྱི་བུ་དག་ཡོངས་སུ་བརྟག་པ་བཟུང་སྟེ་སེམས་ཅན་གང་ལ་ལ་སེམས་ཅན་གྱི་ཁམས་སུ་བསྡུ་བར་བསྡུས་པ། ཁམས་དང་སྐྱེ་མཆེད་ལ་གནས་པའི་སེམས་ཅན་དེ་དག་གལ་ཏེ་རེ་རེའི་ལུས་ཀྱང་རི་རབ་ཙམ་དུ་གྱུར་དུ་ཟིན་ཀྱང་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེས་སེམས་ཅན་ལུས་དེ་ལྟ་བུར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཡུངས་འབྲུ་གཅིག་གི་ནང་དུ་ཆུད་པར་ནུས་སོ། །སེམས་ཅན་རེ་རེ་ཞིང་ཡང་ཡུལ་དང་གནས་ཀྱི་སྐབས་ཡངས་ཏེ།
en: Because, O noble children, the thus-gone Śākyamuni has such great skillful means, he has the ability to expand space. Noble children, imagine that he is able to accommodate in a single mustard seed all the beings, who depend for existence on physical elements and sense faculties, taken together from their respective realms, even if each and every one of them were as big as Mount Meru.

source: སེམས་ཅན་དེ་དག་ཕན་ཚུན་དུ་མིག་རྒྱང་གིས་ཀྱང་མི་སླེབས་སོ།
en: Each of them would have ample room for themselves and none would even arrive in one another’s field of vision.

source: །ཡུངས་འབྲུ་དེ་གཅིག་ཏུ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་བཅུག་ཀྱང་བྲི་བ་དང་གང་བར་ཡང་མི་མངོན་ཏེ།
en: Even if the bodies of all beings were placed in a single mustard seed, they would not appear to shrink, nor would the seed appear to grow.

source: རིགས་ཀྱི་བུ་དག་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ནི་ཐབས་མཁས་པ་དེ་ལྟ་བུ་དང་ལྡན་ནོ།
en: The thus-gone Śākyamuni, noble children, is indeed endowed with such skill in means.

source: །རིགས་ཀྱི་བུ་དག་གཞན་ཡང་སྲ་བ་ཉིད་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ནི་སའི་ཁམས་ཏེ།
en: “And furthermore, O noble children, whatever solidity there is in existence constitutes the earth element.

source: དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེས་སའི་ཁམས་ཐམས་ཅད་རྡུལ་གཅིག་གི་སྟེང་དུ་འཇོག་ནུས་ལ། རྡུལ་དེ་གཅིག་གི་སྟེང་དུ་སའི་ཁམས་ཐམས་ཅད་བཞག་ཀྱང་བྲི་བའམ་གང་བར་མི་མངོན་ཏེ།
en: The thus-gone Śākyamuni could place all of it within a single particle of dust, and this particle, with all of the earth element having entered there, would not appear to expand, nor would the earth element appear to shrink.

source: དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ནི་ཐབས་མཁས་པ་དེ་ལྟ་བུ་དང་ལྡན་ནོ།
en: With such skill in means is the thus-gone Śākyamuni endowed.

source: །རིགས་ཀྱི་བུ་དག་གཞན་ཡང་གང་ཅུང་ཟད་གཤེར་བར་སྣང་བ་དེ་ཐམས་ཅད་ནི་ཆུའི་ཁམས་ཏེ། དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེས་ཆུའི་ཁམས་དེ་ཐམས་ཅད་སྐྲའི་རྩེ་མོ་གཅིག་ཏུ་ཆུད་པར་ནུས་ལ་སྐྲའི་རྩེ་མོ་དེ་གཅིག་ཏུ་ཆུའི་ཁམས་དེ་ཐམས་ཅད་བཅུག་ཀྱང་བྲི་བའམ་གང་བར་མི་མངོན་ནོ། །རིགས་ཀྱི་བུ་དག་གཞན་ཡང་ཇི་ཙམ་དུ་དྲོ་བར་སྣང་བ་དེ་ཐམས་ཅད་ནི་མེའི་ཁམས་ཏེ། མེའི་ཁམས་གང་སྔོན་བྱུང་བ་དང་། འབྱུང་བ་དང་། འབྱུང་བར་འགྱུར་བ་དེ་ཐམས་ཅད་རྡུལ་ཕྲ་རབ་གཅིག་ཏུ་ཆུད་པར་ནུས་ལ་མེའི་ཁམས་དེ་ཐམས་ཅད་རྡུལ་ཕྲ་རབ་དེ་གཅིག་ཏུ་བཅུག་ཀྱང་གནས་ཤིན་ཏུ་ཡངས་ཏེ། རང་གི་ཡུལ་བཞིན་དུ་རྒྱུའོ།
en: “Again, O noble children, anything that appears as wet constitutes the water element—the thus-gone Śākyamuni could place all of it on a single hair tip, and this hair tip, with all the water element having entered there, would not appear to expand, nor would the water element appear to shrink.

source: །རིགས་ཀྱི་བུ་དག་གཞན་ཡང་གང་ཅུང་ཟད་རླུང་གི་ཁམས་སུ་སྣང་བའི་རླུང་གི་ཁམས་དེ་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེས་བ་སྤུའི་ཁུང་བུ་གཅིག་ཏུ་འཇུག་ནུས་ལ།
en: With such skill in means is the thus-gone Śākyamuni endowed. “And further, O noble children, whatever of the wind element is known to exist, the thus-gone Śākyamuni could place all of it within a single pore.

source: རླུང་གི་ཁམས་དེ་ཐམས་ཅད་བ་སྤུའི་ཁུང་བུ་དེ་གཅིག་ཏུ་བཅུག་ཀྱང་གནས་ཤིན་ཏུ་ཡངས་ཏེ། རང་གི་ཡུལ་བཞིན་དུ་རྒྱུའོ།
en: This entire element of wind, even though contained within a single pore of skin, would be able to move around, provided with ample room as if within its own usual sphere of activity.

source: །རིགས་ཀྱི་བུ་དག་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེས་ནི་གང་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཐམས་ཅད་ཀྱི་སེམས་ཅན་ཐམས་ཅད་འབྱུང་བ་ཆེན་པོ་བཞི་པོ་དེ་དག་ཐམས་ཅད་དང་། ལྷན་ཅིག་ཏུ་རྡུལ་གཅིག་གི་སྟེང་དུ་འཇོག་པར་ནུས་ཏེ།
en: “Again, O noble children, anything that appears as hot constitutes the fire element. The thus-gone Śākyamuni could place anything relating to the fire element that has arisen, is arising, or will arise within a single particle of dust. Even if the entire fire element was gathered there in a single particle, it would still be able to function within that single particle, provided with ample range as if within its own usual domain. “And further, O noble children, whatever buddha fields there are in the ten directions, the thus-gone Śākyamuni could place all of them, together with all the beings there and the four great elements, on a single hair tip.

source: རྡུལ་གཅིག་ལ་སེམས་ཅན་དེ་དག་ཐམས་ཅད་འབྱུང་བ་ཆེན་པོ་དེ་དག་དང་བཅས་པར་རང་གི་ཡུལ་གྱི་ལས་ཀྱིས་མཐའ་རྣམས་སྤྱོད་ཀྱང་གནས་ཤིན་ཏུ་ཡངས་པར་རྒྱུ་སྟེ།
en: “Then, in that infinitely small space, all those beings and the great elements would be able to go about their usual business and move around as if in their own usual spheres of operation, provided with sufficient space.

source: ཕན་ཚུན་གནོད་པ་ཡང་མེད་ལ་རྡུལ་གཅིག་གི་རྩེ་མོ་དེ་ཡང་བྲི་བའམ་གང་བར་ཡང་མི་མངོན་ཏེ།
en: They would not get into each other’s way, and this infinitely small space would not appear to expand, nor would they appear to shrink.

source: །རིགས་ཀྱི་བུ་དག་གཞན་ཡང་དུས་གསུམ་དུ་གཏོགས་པའི་སེམས་ཅན་རྣམས་ཀྱི་སྐྱེ་མཆེད་དྲུག་དང་། སྤྱོད་པ་དང་། ཉེ་བར་ལེན་པ་དང་། སྨོན་ལམ་དང་། བྱིན་གྱི་རླབས་དང་། ཚིག་གི་ལམ་གྱི་སྒྲ་དང་། ཡི་གེ་དང་། ཚིག་བརྗོད་པ་དང་། འདུ་བྱེད་གསུམ་གྱི་ལས་ཀྱི་མཐའི་བྱ་བ་དང་། ཕུང་པོ་དང་། དཔྱོད་པ་དང་། བསགས་པའི་བྱ་བ་ཐ་དད་པ་ཇི་སྙེད་པ་དང་། གང་ཡང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་མཐའི་མུ་ནས་བཟུང་སྟེ།
en: “And further, O noble children, the thus-gone Śākyamuni can know the six sense bases, conduct, grasping, aspirations, blessings, ranges of speech, sounds, phonemes, expressions of language, actions or endeavors that involve the three predispositions, aggregates, analytical minds, and the range of methods for gathering accumulations of all the beings of the three times, in a single instant. He is able to know anything at all about any being from the far reaches of the past to that which generates the rebirths in saṃsāra of any of the six kinds of beings throughout the three times, as well as their deaths, births, and what occurs for each of them. He can know the extent of the particles of earth. He can know how beings pass the moments and hours throughout the three times.

source: དུས་གསུམ་དུ་གཏོགས་པའི་འགྲོ་བ་དྲུག་ཏུ་འཁོར་བ་ན་སྲིད་པ་འགྲུབ་པ་དང་། འཆི་འཕོ་དང་། སྐྱེ་བ་འབྱུང་བ་དང་། སའི་ཁམས་ཀྱི་རྡུལ་ཕྲ་རབ་ཇི་སྙེད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དུས་གསུམ་དུ་གཏོགས་པའི་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་འདས་པ་ཇི་སྙེད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དུས་གསུམ་དུ་གཏོགས་པའི་སྤུའི་ཁུང་བུ་ཇི་སྙེད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དུས་གསུམ་དུ་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལོངས་སྤྱོད་པ་དང་། ཀུན་ཏུ་སྤྱོད་པ་དང་། བདེ་བ་དང་། སྡུག་བསྔལ་མྱོང་བར་འགྱུར་བ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེས་སྐད་ཅིག་གཅིག་ལ་རབ་ཏུ་མཁྱེན་ཏེ།
en: He can know every pore of all beings throughout the three times. He can know the extent of the enjoyments, behaviors, and experiences of happiness and suffering of all beings throughout the three times. The thus-gone Śākyamuni can know all this within a single instant.

source: དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ནི་མཚན་ཉིད་ཀྱི་རྣམ་པར་འཕྲུལ་པ་དང་། མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་འདི་ལྟ་བུ་དང་ལྡན་པས་མི་རྟོག་རྣམ་པར་མི་རྟོག་ཅིང་ལྷུན་གྱིས་གྲུབ་པར་དུས་གསུམ་གྱི་མཐའ་ཡོངས་སུ་མཁྱེན་ཏོ།
en: “The thus-gone Śākyamuni is able to comprehend the three times up to their farthest limit effortlessly and without ideas or concepts, because he is endowed with this kind of clairvoyant wisdom that is miraculous in character.

source: །རིགས་ཀྱི་བུ་དག་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་སངས་རྒྱས་ཀྱི་ཡུལ་ལ་འཇུག་པའི་ཡེ་ཤེས་ལ་མཁས་པས་མཉམ་པ་ཉིད་ཀྱིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་ཐབས་ཚད་མེད་པ་འདི་ལྟ་བུ་དང་ལྡན་ནོ།
en: The thus-gone Śākyamuni is endowed with such immeasurable means to bring beings to maturity through equanimity, O noble children, because of his skill in wisdom that derives from his buddha domain.”

source: །མཚན་ཉིད་བཤད་པ་འདི་ལུང་བསྟན་པ་ན་ཕྱོགས་ཐ་དད་པ་དག་ན་དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་སོ་སོའི་འཁོར་བྱང་ཆུབ་སེམས་དཔའ་བརྒྱ་སྟོང་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་སྨོན་ལམ་གྱི་ཡུལ་ལ་འཇུག་པའི་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པར་གྱུར་ཏོ།
en: When these characteristics were elucidated, infinite and uncountable hundreds of thousands of bodhisattvas from the respective retinues of the thus-gone ones from all the different directions reached the perfection of insight, based on their previous aspirations.

source: །འདུས་པ་ཆེན་པོ་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་ལས། མཚན་ཉིད་ཀྱི་ལེའུ་སྟེ་ལྔ་པའོ།།
en: This concludes the chapter on the characteristics of the Buddha, the fifth in the “ Ratnaketu ” section of the Great Collection of Mahāyāna sūtras.

source: །།བམ་པོ་དྲུག་པ།
en: Chapter

source: ཡང་དེའི་ཚེ་ཤར་ཕྱོགས་ལོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་མངོན་པར་དགའ་བ་ན་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་རྣམས་དང་ཐབས་ཅིག་ཏུ་སངས་རྒྱས་ཀྱི་ཡུལ་ལ་རྣམ་པར་འཕྲུལ་པའི་བྱིན་གྱི་རླབས་ཀྱི་སྟོབས་ཀྱིས་གཤེགས་པར་ཆས་ནས།
en: At that time the thus-gone Akṣobhya set out from the world in the east called Abhirati in the company of an infinite number of bodhisattva great beings.

source: སྐད་ཅིག་གཅིག་ཙམ་ལ་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་དབུས་ཀྱི་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་བྱོན་ཏེ།
en: Through the power and mastery of miracles particular to a buddha, he arrived instantaneously in the buddha field that includes the central world with its four continents, where the thus-gone, worthy, perfect buddha Śākyamuni was staying.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ག་ལ་བཞུགས་པ་དེར་གཤེགས་ནས་པད་མའི་གདན་ཇི་ལྟ་བུ་བྱུང་བ་ལ་བཞུགས་སོ།
en: Having arrived, he sat upon a lotus seat that appeared just as needed.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཀྱང་རང་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་བསྐྱེད་པས་པད་མའི་གདན་ཇི་ལྟ་བུ་བྱུང་བ་དེ་དག་ལ་འཁོད་དོ། །དེ་དག་ལ་སོགས་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བཞུགས་ཤིང་འཚོ་ལ་གཞེས་པ།
en: The bodhisattva great beings from his retinue also sat upon lotus seats that appeared through their own magical power.

source: སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་དཔག་ཏུ་མེད་པའི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱང་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ཉིད་ལ་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་དབུས་ཀྱི་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་བྱོན་ཏོ།
en: Headed by Akṣobhya, infinite numbers of the blessed buddhas living in buddha fields as numerous as atoms also arrived. They arrived in a split second, in the same buddha field that includes the central world with its four continents where the thus-gone, worthy, perfect buddha Śākyamuni was staying.

source: །དེ་བཞིན་གཤེགས་པ་རེ་རེ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དང་། ཉན་ཐོས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དང་ཐབས་ཅིག་ཏུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དེ་ག་ལ་བཞུགས་པར་བྱོན་ཏོ།
en: Each and every one of these thus-gone ones was accompanied by an infinite number of bodhisattva great beings and hundreds of thousands of millions of billions of hearers.

source: །བྱོན་ནས་ཀྱང་པད་མའི་གདན་ཇི་ལྟ་བུ་བྱུང་བ་རྣམས་ལ་བཞུགས་སོ།
en: Having arrived, they sat down upon lotus seats that appeared just as needed.

source: །ཡང་དེའི་ཚེ་ན་ལྷོ་ཕྱོགས་ལོགས་ནས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེ་ཏོག་ཅེས་བྱ་བ་བྱོན་ནས་པད་མའི་སྙིང་པོ་ལ་བཞུགས་པའི་བར་དུ་རྒྱས་པར་བྱའོ།
en: At the same time, the thus-gone Ratnadhvaja came from the south . . . and he sat upon a seat of lotus filaments.

source: །དེ་བཞིན་དུ་བྱང་ཕྱོགས་ལོགས་ནས་དེ་བཞིན་གཤེགས་པ་རྔ་སྒྲ་ཞེས་བྱ་བ་བྱོན་ནས་པད་མའི་སྙིང་པོ་ལ་བཞུགས་སོ།
en: In the same way there came from the north the thus-gone Dundubhisvara. Having arrived, he sat upon a seat of lotus filaments.

source: །ཡང་དེའི་ཚེ་ནུབ་ཕྱོགས་ལོགས་ནས་དེ་བཞིན་གཤེགས་པ་ཚེ་དཔག་མེད་ཅེས་བྱ་བ་བྱོན་ནས་པད་མའི་སྙིང་པོ་ལ་བཞུགས་པའི་བར་དུའོ།
en: At the same time, the thus-gone Amitāyus came from the west. Having arrived . . . he sat upon a seat of lotus filaments.

source: །འོག་གི་ཕྱོགས་ལོགས་ནས་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་ཅེས་བྱ་བ་བྱོན་ནས་པད་མའི་སྙིང་པོ་ལ་བཞུགས་པའི་བར་དུའོ། །སྟེང་གི་ཕྱོགས་ལོགས་ནས་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ཀྱི་འོད་ཟེར་ཞེས་བྱ་བ་བྱོན་ནས།
en: Simultaneously, the thus-gone Vairocana came from below. Having arrived . . . he sat upon a seat of lotus filaments.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གྲངས་མེད་དཔག་ཏུ་མེད་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དང་ཐབས་ཅིག་ཏུ་སངས་རྒྱས་ཀྱི་ཡུལ་ཐམས་ཅད་རྣམ་པར་འཕྲུལ་པའི་བྱིན་གྱི་རླབས་ཀྱིས་དེ་ནས་གཤེགས་པར་ཆས་པ་དང་། སེམས་ཀྱི་སྐད་ཅིག་གཅིག་ལ་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་དབུས་ཀྱི་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ག་ལ་བཞུགས་པ་དེར་གཤེགས་ནས་པད་མའི་གདན་ཇི་ལྟ་བུ་བྱུང་བ་ལ་བཞུགས་སོ།
en: The thus-gone Jñānaraśmirāja came from above, accompanied by infinite and uncountable hundreds of thousands of millions of billions of bodhisattva great beings, just like specks of dust, hailing from the buddha fields above as numerous as the grains of sand in the river Gaṅgā. Through his mastery of miracles particular to a buddha, he started off, and within a single instant of thought he arrived in the buddha field that includes the central world with its four continents, where the thus-gone, worthy, perfect buddha Śākyamuni was staying. Having arrived, he sat upon a lotus throne that appeared just as needed.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཀྱང་ཇི་ལྟར་རང་རང་གི་བསོད་ནམས་དང་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་པད་མའི་གདན་སྤྲུལ་པ་རྣམས་ལ་འཁོད་དོ།
en: The bodhisattva great beings all sat upon lotus seats that miraculously appeared through their own mastery of magical power according to their individual stores of merit.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕྱོགས་བཅུ་ནས་འདུས་པ་དེ་དག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་ལ་ལ་དག་གིས་ནི་འཛམ་བུའི་ཆུ་བོའི་གསེར་གྱི་ཆར་ཕབ་བོ། །གོང་དུ་སྨོས་པ་བཞིན་སྦྱར་ཏེ།
en: Some of the bodhisattvas who had thus gathered from the ten directions around the thus-gone Śākyamuni rained down gold from the Jambu River in an act of worship of the blessed thus-gone ones.

source: ལ་ལ་དག་གིས་ནི་སངས་རྒྱས་ཀྱི་ཞིང་མ་ལུས་པར་བསྐོར་བར་བྱས་སོ།
en: Some circumambulated clockwise the entire buddha field.

source: །ལ་ལ་དག་གིས་ནི་ཆོས་ཉན་པས་བསྐོར་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་སྤྱན་སྔར་ཐལ་མོ་སྦྱར་ཏེ་འཁོད་དོ།
en: Some stood with folded hands in front of the blessed buddhas, eager to hear the Dharma.

source: །ལ་ལ་དག་གིས་ནི་རང་གི་དགེ་བའི་ཕྱོགས་ཡིད་ལ་བྱེད་ཅིང་གནས་སོ།
en: And some directed their minds and abided by modes of virtue particular to themselves.

source: །ཡང་དེའི་ཚེ་ན་ཟླ་འོད་གཞོན་ནུར་གྱུར་པས་ཐལ་མོ་སྦྱར་ཏེ་རང་གི་རྫུ་འཕྲུལ་གྱི་མཐུ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་སྟོབས་བསྐྱེད་པས་སངས་རྒྱས་ཀྱི་ཞིང་འདི་མ་ལུས་པར་དབྱངས་ཀྱིས་བཀང་སྟེ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Subhūti, the princely youth, folded his hands and, drawing on his own magical power and the power of the blessed buddhas, filled up the entire buddha field with the words that he sang: “O moon-like sages,

source: །ཐེ་ཙོམ་ཐམས་ཅད་གཅོད་མཛད་པ།
en: Removers of all doubt who have gathered here!

source: །ཐུབ་པ་ཟླ་བ་ཀུན་ནས་གཤེགས།
en: A gathering of the saṅgha such as this

source: །སྔོན་ཆད་མ་མཐོང་མ་ཐོས་པའི། །དགེ་འདུན་ཕུན་སུམ་ཚོགས་འདི་སྣང་།
en: Has never been seen or heard of before.

source: །བྱང་ཆུབ་སེམས་དཔའ་བརྟུལ་ཞུགས་མཆོག །སངས་རྒྱས་ཀུན་གྱིས་རབ་གང་བས།
en: “Totally filled with bodhisattvas of supreme austerity And all the buddhas,

source: །ཞིང་འདི་མཆོད་རྟེན་གྱུར་པ་སྟེ།
en: This buddha field is now a caitya,

source: །ཞིང་རྣམས་ཀུན་གྱིས་ཕྱག་བྱས་སོ། །གང་ན་སེམས་ཅན་སྨད་པ་ཡི། །ཞིང་ནི་སྙིགས་མ་ལྔ་ལྡན་འདིར།
en: Honored by every other field.

source: །ཐུབ་པ་སྣང་མཛད་རྒྱུ་མེད་པར།
en: “It is not without a reason that you,

source: །རྫོགས་པའི་སངས་རྒྱས་དེང་མི་གཤེགས།
en: The sun-like sages, the perfect buddhas, Have come today to this field, rife with the five degenerations, Scorned as it is by beings.

source: །དེ་རིང་བདུད་ངན་ཚར་གཅད་ཅིང་།
en: “Today the vile Māra will meet his ruin

source: །ནག་པོའི་ཕྱོགས་ནི་རབ་གཞོམ་དང་། །སྤྱོད་པ་དགེ་བ་བསྡུ་བའི་ཕྱིར།
en: And his black faction will be destroyed, While those with pure conduct stand united—

source: །དེ་ཡི་དོན་དུ་ཀུན་ནས་གཤེགས།
en: This is why they have come together.

source: །ཡིད་ནི་རབ་ཏུ་དང་བྱོས་ལ།
en: “Let your minds be filled with admiration,

source: །བདུད་སྡེ་རབ་ཏུ་འཇོམས་པ་ཡི།
en: For the hordes of Māra are to be defeated.

source: །ཆོས་ཉིད་ཞི་བར་རབ་ཉོན་ལ།
en: Hear all about the peaceful nature of reality,

source: །རྫོགས་པའི་སངས་རྒྱས་འགྱུར་བར་བྱོས།
en: And then awaken to perfect buddhahood! {6.5} “You will understand that the Mahāyāna

source: །ཐེག་པ་ཆེན་པོ་སྤྱོད་པའི་ལམ།
en: Is a path of practice with acceptance as its armor.

source: །བཟོད་པའི་གོ་བགོས་ཤེས་པར་བྱོས།
en: Hear this dhāraṇī-seal today

source: །ཉོན་མོངས་ཐམས་ཅད་ཟད་བྱའི་ཕྱིར།
en: In order to remove all afflictions! “Let us all together, with one voice, Invite the guides

source: །གཟུངས་འདི་དེ་རིང་མཉན་པར་བྱོས།
en: Who will teach this means of protection

source: །གདན་རྣམས་ལ་ནི་བཞུགས་ནས་ནི།
en: While seated on their thrones.

source: །བསྲུང་བ་འདི་ནི་བཤད་གསོལ་ཕྱིར།
en: “May this invincible dhāraṇī,

source: །དེ་ཕྱིར་ཐམས་ཅད་མགྲིན་གཅིག་ཏུ། །འདྲེན་པ་རྣམས་ནི་སྤྱན་དྲོངས་ཤིག །དམ་ཆོས་ཡུན་རིང་གནས་བྱའི་ཕྱིར།
en: Which contains all the Dharma teachings

source: །སྒྲིབ་པ་ཐམས་ཅད་ཞི་བྱེད་པ། །ཆོས་རྣམས་ཐམས་ཅད་སྡུད་པ་ཡི། །གཟུངས་འདི་གཞན་གྱིས་མི་ཐུབ་བོ།
en: And pacifies all obscurations, be taught So that the sublime Dharma may be made to remain for a long time.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པ་ཐོབ་པ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དེ་སྙེད་ཀྱིས་མགྲིན་གཅིག་ཏུ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Subsequently, infinite and uncountable numbers of bodhisattva great beings implored with a single voice, “O most compassionate blessed buddhas!

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་པད་མའི་གདན་འདི་དག་ལ་བཞུགས་ཏེ་དེང་ཐུགས་རྗེ་ཆེན་པོ་དང་ལྡན་པ་རྣམས་ཀྱིས་བྱམས་པ་ཆེན་པོའི་མཆོག་དང་བཟོད་པས་ཡོངས་སུ་བསྒོམ་པ། མི་འཇིགས་པའི་རྒྱུ་འཐུན་པ་བཤད་པ་ཆོས་ཐམས་ཅད་སྡུད་པ། འཇིགས་པ་དང་བྲལ་བ་ལ་འཇུག་པ།
en: Please remain on your lotus seats and teach now this dhāraṇī that is suffused with the utmost loving kindness and acceptance, is composed with great skill, and contains all Dharma teachings—the one that removes fear;

source: བདུད་ཀྱི་ཡུལ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པར་བགྱིད་པ། བདུད་ཀྱི་རྒྱལ་མཚན་རབ་ཏུ་སྙོལ་ལ་ཆོས་ཀྱི་རྒྱལ་མཚན་བསྒྲེང་བར་བགྱིད་པ། ཉོན་མོངས་པ་ཐམས་ཅད་འཇོམས་པ།
en: enables escape from all the domains of Māra ; topples the banner of Māra , and raises the banner of the Dharma;

source: དགྲ་ཐམས་ཅད་ཚར་གཅོད་པ། ཐེ་ཙོམ་ཐམས་ཅད་གཅོད་པ། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་འཛུད་པ། འཇིགས་པ་ཐམས་ཅད་ལས་རྣམ་པར་ཐར་བར་བགྱིད་པ། དགྲ་ཐམས་ཅད་བསྲུང་བ་བླ་ན་མེད་པ།
en: obliterates all afflictions; defeats all enemies, severs all doubts, brings one to omniscient wisdom, frees one from all fears, offers complete and matchless protection;

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ཆོས་ཐམས་ཅད་དྲན་པ་དང་། བློ་གྲོས་དང་། རྟོགས་པ་དང་། མོས་པ་མི་བརྗེད་པ།
en: ensures no loss of memory, intelligence, demeanor, or steadfastness with regard to all the qualities of the bodhisattvas;

source: སྤྱོད་པ་ཐམས་ཅད་ཀྱི་ཐབས་དང་ཡེ་ཤེས་ལ་མཁས་པ་ཀུན་སྟོན་པ།
en: shows the complete array of conduct, skillful means, and wisdom;

source: བདེ་བ་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་ཀྱི་སྐྱེ་མཆེད་དང་། བྱིན་གྱི་རླབས་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་དང་། བཟོད་པ་ལ་འཇུག་པ།
en: brings one to the sense bases, blessings, absorption, dhāraṇī, and acceptance that support perfect happiness;
